docs/notification-benchmark-runs/20260914-094021-f898f084/sync-comment-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: E:\goProject\library\src\GoStudy\AiDevClub\scripts\notification-benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10s max duration (incl. graceful stop):
              * notification_write: 2 looping VUs for 5s (gracefulStop: 5s)


running (01.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
notification_write   [  20% ] 2 VUs  1.0s/5s

running (02.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
notification_write   [  40% ] 2 VUs  2.0s/5s

running (03.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
notification_write   [  60% ] 2 VUs  3.0s/5s

running (04.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
notification_write   [  80% ] 2 VUs  4.0s/5s

running (05.0s), 2/2 VUs, 38 complete and 0 interrupted iterations
notification_write   [ 100% ] 2 VUs  5.0s/5s


  █ TOTAL RESULTS 

    checks_total.......: 40      7.643925/s
    checks_succeeded...: 100.00% 40 out of 40
    checks_failed......: 0.00%   0 out of 40

    ✓ comment endpoint returns HTTP 200

    CUSTOM
    benchmark_error_rate...........: 0.00%  0 out of 40
    benchmark_request_duration.....: avg=258.43ms min=247.61ms med=254.7ms  max=310.67ms p(90)=273.37ms p(95)=279.61ms p(99)=299.47ms
    benchmark_requests.............: 40     7.643925/s

    HTTP
    http_req_duration..............: avg=258.43ms min=247.61ms med=254.7ms  max=310.67ms p(90)=273.37ms p(95)=279.61ms p(99)=299.47ms
      { expected_response:true }...: avg=258.43ms min=247.61ms med=254.7ms  max=310.67ms p(90)=273.37ms p(95)=279.61ms p(99)=299.47ms
    http_req_failed................: 0.00%  0 out of 40
    http_reqs......................: 40     7.643925/s

    EXECUTION
    iteration_duration.............: avg=260.39ms min=247.61ms med=254.97ms max=312.29ms p(90)=279.73ms p(95)=309.48ms p(99)=311.66ms
    iterations.....................: 40     7.643925/s
    vus............................: 2      min=2       max=2
    vus_max........................: 2      min=2       max=2

    NETWORK
    data_received..................: 6.7 kB 1.3 kB/s
    data_sent......................: 16 kB  3.0 kB/s



running (05.2s), 0/2 VUs, 40 complete and 0 interrupted iterations
notification_write ✓ [ 100% ] 2 VUs  5s